STMicroelectronics/STM32CubeG4/Drivers/BSP/STM32G474E-EVAL/stm32g474e_eval_sd.c
#define SD_ACMD_SD_STATUS             13  /* ACMD13   */
#define SD_ACMD_SEND_OP_COND          41  /* ACMD41   */
#define SD_ACMD_SEND_SCR              51  /* ACMD51   */

/**
  * @brief  SD card Timeout values
  */
#define SD_WRITE_TIMEOUT         100U
#define SD_READ_TIMEOUT          0xFFFFU
/**
  * @}
  */

/** @defgroup STM32G474E-EVAL_SD_Private_Macros Private Macros
  * @{
  */
/**
  * @brief  SD chip select unactive (high) : SD not selected.
  * @retval none
  */
#define SD_CS_OFF()    HAL_GPIO_WritePin(SD_CS_GPIO_PORT, SD_CS_PIN, GPIO_PIN_RESET)
#define SD_CS_HIGH()   HAL_GPIO_WritePin(SD_CS_GPIO_PORT, SD_CS_PIN, GPIO_PIN_SET)
/**
  * @brief  SD chip select active(low) : SD selected.
  * @retval none
  */
#define SD_CS_ON()     HAL_GPIO_WritePin(SD_CS_GPIO_PORT, SD_CS_PIN, GPIO_PIN_SET)
#define SD_CS_LOW()    HAL_GPIO_WritePin(SD_CS_GPIO_PORT, SD_CS_PIN, GPIO_PIN_RESET)

#define SD_IO_WriteDummy()   (void)BSP_SPI2_Send((uint8_t*)&DummyByte, 1)

/**
  * @}
  */

/** @defgroup STM32G474E-EVAL_SD_Private_Variables Private Variables
  * @{
  */
static uint8_t CardType = SD_CARD_SDSC;
static uint32_t DummyByte = (uint32_t)SD_DUMMY_BYTE;

/**
  * @}
  */

/** @defgroup STM32G474E-EVAL_SD_Exported_Variables Exported Variables
  * @{
  */
EXTI_HandleTypeDef hsd_exti;
/**
  * @}
  */

/** STM32G474E-EVAL_SD_Private_FunctionPrototypes Private Functions
  */
static int32_t SD_WriteBlock(uint32_t Instance, uint8_t* pData, uint32_t WriteAddr, uint16_t BlockSize);
static int32_t SD_ReadBlock(uint32_t Instance, uint8_t* pData, uint32_t ReadAddr, uint16_t BlockSize);

#if defined (USE_SPI_DMA)
static void SD_Msp_Init(SD_HandleTypeDef *hsd);
static void SD_Msp_DeInit(SD_HandleTypeDef *hsd);
#endif /* (USE_SPI_DMA)*/

static int32_t SD_GetCIDRegister(SD_CardIdData_t* Cid);
static int32_t SD_GetCSDRegister(SD_CardSpecificData_t* Csd);
static int32_t SD_GetOCRegister(uint8_t* pCCS);

static uint8_t SD_GetDataResponse(void);
static int32_t SD_GoIdleState(void);

static void SD1_EXTI_Callback(void);

SD_CmdAnswer_typedef SD_SendCmd(uint8_t Cmd, uint32_t Arg, uint8_t Crc, uint8_t Answer);

static uint8_t SD_ReadData(void);
static int32_t SD_WaitData(uint8_t data);
static SD_CmdAnswer_typedef SD_WaitResponse( uint8_t Answer, uint8_t Response);

uint8_t SD_IO_ReadByte(void);
uint8_t SD_IO_WriteByte(uint8_t Data);

/* Link functions for SD Card peripheral*/
void SD_IO_Init(void);
void SD_IO_DeInit(void);
void SD_IO_CSState(uint8_t val);
/**
  */

/** @addtogroup STM32G474E-EVAL_SD_Exported_Functions
  * @{
  */

/**
  * @brief  Initializes the SD card device.
  * @param  Instance      SD Instance
  * @retval BSP status
  */
int32_t BSP_SD_Init(uint32_t Instance)
{
  int32_t ret;

  if(Instance >= SD_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }/* Initialize IO functionalities (MFX) used by SD detect pin */
  else if(BSP_IOEXPANDER_Init(0, IOEXPANDER_IO_MODE)!= BSP_ERROR_NONE)
  {
    ret = BSP_ERROR_BUS_FAILURE;
  }
  else
  {
      /* SD pin init (MFX) */
      SD_IO_Init();

      /* Check if SD card is present */
      if(BSP_SD_IsDetected(Instance) != BSP_ERROR_NONE)
      {
        ret = BSP_ERROR_UNKNOWN_COMPONENT;
      }
      else
      {
          /* SD initialized and set to SPI mode properly */
          ret = SD_GoIdleState();
      }
      /* Interrupt already enabled on BSP_IO_Init, just register callback */
      if (HAL_EXTI_GetHandle(&hsd_exti, SD_EXTI_LINE) == HAL_OK)
      {
       if (HAL_EXTI_RegisterCallback(&hsd_exti, HAL_EXTI_COMMON_CB_ID, SD1_EXTI_Callback) != HAL_OK)
       {
        ret = BSP_ERROR_PERIPH_FAILURE;
       }
      }
      else
      {
       ret = BSP_ERROR_PERIPH_FAILURE;
      }
    }
  return ret;
}

/**
  * @brief  DeInitializes the SD card device.
  * @param  Instance      SD Instance
  * @retval BSP status
  */
int32_t BSP_SD_DeInit(uint32_t Instance)
{
  int32_t ret = BSP_ERROR_NONE;

  SD_CS_OFF();

  if(Instance >= SD_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
   SD_IO_WriteDummy();
   SD_CS_OFF();
  }
  return ret;
}

/**
  * @brief  Configures Interrupt mode for SD detection pin.
  * @param  Instance      SD Instance
  * @retval BSP status
  */
int32_t BSP_SD_DetectITConfig(uint32_t Instance)
{
  int32_t ret;
  BSP_IO_Init_t io_init_structure;
  UNUSED(Instance);

  io_init_structure.Pin  = SD_DETECT_PIN;
  io_init_structure.Pull = IO_PULLUP;

  /* Configure IO interrupt acquisition mode */
  if(BSP_IO_ReadPin(0, SD_DETECT_PIN) == (int32_t)IO_PIN_RESET)
  {
    io_init_structure.Mode = IO_MODE_IT_RISING_EDGE;
  }
  else
  {
    io_init_structure.Mode = IO_MODE_IT_FALLING_EDGE;
  }

  if(BSP_IO_Init(0, &io_init_structure) != BSP_ERROR_NONE)
  {
    ret = BSP_ERROR_BUS_FAILURE;
  }
  else
  {
    ret = BSP_ERROR_NONE;
  }

  /* Return BSP status */
  return ret;
}

/**
  * @brief  BSP SD Callback.
  * @param  Instance SD Instance
  * @param  Status   Pin status
  * @retval None.
  */
__weak void BSP_SD_DetectCallback(uint32_t Instance, uint32_t Status)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(Instance); 
  UNUSED(Status);

  /* This function should be implemented by the user application.
     It is called into this driver when an event on JoyPin is triggered. */
}

/**
 * @brief  Detects if SD card is correctly plugged in the memory slot or not.
  * @param Instance  SD Instance
 * @retval Returns BSP_ERROR_COMPONENT_FAILURE if SD is not present
 *                 BSP_ERROR_NONE if SD is present
 *                 BSP_ERROR_WRONG_PARAM if Instance is not correct
 */
int32_t BSP_SD_IsDetected(uint32_t Instance)
{
  int32_t ret;

  if(Instance >= SD_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    if ( BSP_IO_ReadPin(0, SD_DETECT_PIN) == (int32_t)IO_PIN_RESET)
       { ret = BSP_ERROR_NONE; }
    else
       { ret = BSP_ERROR_COMPONENT_FAILURE ;}
  }
  return ret;
}

/**
  * @brief  Erases the specified memory area of the given SD card.
  * @param  Instance    SD Instance
  * @param  Blockindex  Block index from where data is to be erased
  * @param  BlockNbr    Number of SD blocks to erase
  * @retval BSP status
  * @note   BlockNbr and Blockindex are multiple of SD_BLOCKSIZE (512 Bytes)
  */
int32_t BSP_SD_Erase(uint32_t Instance, uint32_t Blockindex, uint32_t BlockNbr)
{
  int32_t ret = BSP_ERROR_PERIPH_FAILURE;
  SD_CmdAnswer_typedef response;
  UNUSED(Instance);

  if(Instance >= SD_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
   /* Send CMD32 (Erase group start) and check if the SD acknowledged the erase command: R1 response (0x00: no errors) */
   response = SD_SendCmd(SD_CMD_SD_ERASE_GRP_START, Blockindex * ((CardType == SD_CARD_SDHC) ? 1U : SD_BLOCKSIZE), 0xFF, (uint8_t)SD_ANSWER_R1_EXPECTED );
   SD_CS_HIGH();
   SD_IO_WriteDummy();
   if (response.r1 == (uint8_t)SD_R1_NO_ERROR)
   {
    /* Send CMD33 (Erase group end) and Check if the SD acknowledged the erase command: R1 response (0x00: no errors) */
    response = SD_SendCmd(SD_CMD_SD_ERASE_GRP_END, ((Blockindex + BlockNbr)) * ((CardType == SD_CARD_SDHC) ? 1U : SD_BLOCKSIZE), 0xFF, (uint8_t)SD_ANSWER_R1_EXPECTED );
    SD_CS_HIGH();
    SD_IO_WriteDummy();
    if (response.r1 == (uint8_t)SD_R1_NO_ERROR)
    {
      /* Send CMD38 (Erase) and Check if the SD acknowledged the erase command: R1b response (0x00: no errors) */
      response = SD_SendCmd(SD_CMD_ERASE, 0, 0xFF, (uint8_t)SD_ANSWER_R1B_EXPECTED);

