STMicroelectronics/STM32CubeG4/Drivers/BSP/STM32G474E-EVAL/stm32g474e_eval_sd.c
      /* in R1b response, the non-zero value in r2 indicates the cards is no more busy */
      if ( (response.r1 == (uint8_t)SD_R1_NO_ERROR))
      {
              SD_IO_WriteDummy();
              if(response.r2 == (uint8_t)SD_R1_NO_ERROR)
              {
                ret = BSP_ERROR_BUSY;
              }
              else
              {
                ret = BSP_ERROR_NONE;
              }
      }
      SD_CS_HIGH();
      SD_IO_WriteDummy();
    }
   }
  }
  /* Return BSP status */
  return ret;
}

/**
  * @brief  Writes data to a specified address in an SD card, in polling mode.
  * @param  Instance   SD Instance
  * @param  pData      Pointer to the buffer that will contain the data to transmit
  * @param  BlockAddr  Address of the block from where data is to be written
  * @param  BlockNbr   Number of SD blocks to write
  * @retval BSP status
  * @note   BlockAddr is a multiple of SD_BLOCKSIZE (512 Bytes)
  */
int32_t BSP_SD_WriteBlocks(uint32_t Instance, uint32_t* pData, uint32_t BlockAddr, uint32_t BlockNbr)
{
  int32_t ret;
  uint8_t *pByte;
  uint32_t block_addr;
//  uint32_t pByte;

  if(Instance >= SD_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
  //  pByte = (uint32_t)&pData;
    pByte = (uint8_t *)pData;
    block_addr = BlockAddr * SD_BLOCKSIZE;
    /* Data transfer */
    do 
    {
       ret = SD_WriteBlock(Instance, (uint8_t *)pByte, block_addr, SD_BLOCKSIZE);
       if (ret != BSP_ERROR_NONE) break;
       /* loop on next block : Set next write address */
       pByte += SD_BLOCKSIZE;
       block_addr += SD_BLOCKSIZE;
       BlockNbr--;
    } while ((BlockNbr != 0U) && (ret == BSP_ERROR_NONE));
  }
  /* Returns the response */
  return ret;
}

/**
  * @brief  Reads data from a specified address in an SD card, in polling mode.
  * @param  Instance        SD Instance
  * @param  pData           Pointer to the buffer that will contain the data to transmit
  * @param  BlockAddr       Address of the block from where data is to be read
  * @param  BlockNbr        Number of SD blocks to read
  * @retval BSP status
  * @note   BlockAddr is a multiple of SD_BLOCKSIZE (512 Bytes)
  */
int32_t BSP_SD_ReadBlocks(uint32_t Instance, uint32_t* pData, uint32_t BlockAddr, uint32_t BlockNbr)
{
  int32_t ret;
  uint8_t *pByte;
  uint32_t block_addr;

  if(Instance >= SD_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
      pByte = (uint8_t *)pData;
      block_addr = BlockAddr * SD_BLOCKSIZE;
      /* Data transfer */
      do
      {
       ret = SD_ReadBlock(Instance, (uint8_t *)pByte, block_addr, SD_BLOCKSIZE);
       if (ret != BSP_ERROR_NONE) break;
       /* loop on next block : Set next read address */
       pByte += SD_BLOCKSIZE;
       block_addr += SD_BLOCKSIZE;
       BlockNbr--;
     } while ((BlockNbr != 0U) && (ret == BSP_ERROR_NONE));

  }
  /* Returns the response */
  return ret;
}

/**
  * @brief  Reads block(s) from a specified address in an SD card, in DMA mode.
  * @param  Instance   SD Instance
  * @param  pData      Pointer to the buffer that will contain the data to transmit
  * @param  BlockIdx   Block index from where data is to be read
  * @param  BlocksNbr  Number of SD blocks to read
  * @retval BSP status
  */
int32_t BSP_SD_ReadBlocks_DMA(uint32_t Instance, uint32_t *pData, uint32_t BlockIdx, uint32_t BlocksNbr)
{
  int32_t ret;
  UNUSED(pData);
  UNUSED(BlockIdx);
  UNUSED(BlocksNbr);

  if(Instance >= SD_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    ret = BSP_ERROR_FEATURE_NOT_SUPPORTED;
  }
  /* Return BSP status */
  return ret;
}

/**
  * @brief  Writes block(s) to a specified address in an SD card, in DMA mode.
  * @param  Instance   SD Instance
  * @param  pData      Pointer to the buffer that will contain the data to transmit
  * @param  BlockIdx   Block index from where data is to be written
  * @param  BlocksNbr  Number of SD blocks to write
  * @retval BSP status
  */
int32_t BSP_SD_WriteBlocks_DMA(uint32_t Instance, uint32_t *pData, uint32_t BlockIdx, uint32_t BlocksNbr)
{
  int32_t ret;
  UNUSED(pData);
  UNUSED(BlockIdx);
  UNUSED(BlocksNbr);

  if(Instance >= SD_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    ret = BSP_ERROR_FEATURE_NOT_SUPPORTED;
  }
  /* Return BSP status */
  return ret;
}

/**
  * @brief  Reads block(s) from a specified address in an SD card, in DMA mode.
  * @param  Instance   SD Instance
  * @param  pData      Pointer to the buffer that will contain the data to transmit
  * @param  BlockIdx   Block index from where data is to be read
  * @param  BlocksNbr  Number of SD blocks to read
  * @retval SD status
  */
int32_t BSP_SD_ReadBlocks_IT(uint32_t Instance, uint32_t *pData, uint32_t BlockIdx, uint32_t BlocksNbr)
{
  int32_t ret;
  UNUSED(pData);
  UNUSED(BlockIdx);
  UNUSED(BlocksNbr);

  if(Instance >= SD_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    ret = BSP_ERROR_FEATURE_NOT_SUPPORTED;
  }
  /* Return BSP status */
  return ret;
}

/**
  * @brief  Writes block(s) to a specified address in an SD card, in DMA mode.
  * @param  Instance   SD Instance
  * @param  pData      Pointer to the buffer that will contain the data to transmit
  * @param  BlockIdx   Block index from where data is to be written
  * @param  BlocksNbr  Number of SD blocks to write
  * @retval SD status
  */
int32_t BSP_SD_WriteBlocks_IT(uint32_t Instance, uint32_t *pData, uint32_t BlockIdx, uint32_t BlocksNbr)
{
  int32_t ret;
  UNUSED(pData);
  UNUSED(BlockIdx);
  UNUSED(BlocksNbr);

  if(Instance >= SD_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    ret = BSP_ERROR_FEATURE_NOT_SUPPORTED;
  }
  /* Return BSP status */
  return ret;
}

/**
  * @brief  Returns the SD status.
  * @param  Instance   SD Instance
  * @retval The BSP status.
  */
int32_t BSP_SD_GetCardState(uint32_t Instance)
{
  SD_CmdAnswer_typedef response;
  int32_t ret = BSP_ERROR_PERIPH_FAILURE;

  if(Instance >= SD_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
   /* Send CMD13 or ACMD13 and Wait for response in the R2 format (0x00 is no errors) */
   SD_CS_HIGH();
   SD_IO_WriteDummy();
   SD_IO_WriteDummy();
   /* SD chip select low */
   SD_CS_LOW();
   response = SD_SendCmd(SD_CMD_SEND_STATUS, 0, 0xFF, (uint8_t)SD_ANSWER_R2_EXPECTED);

   /* Find SD status according to card state */
   if(( response.r1 == (uint8_t)SD_R1_NO_ERROR) && ( response.r2 == (uint8_t)SD_R2_NO_ERROR))
   {
       ret = BSP_ERROR_NONE;
   }
  }
  /* Send dummy byte: 8 Clock pulses of delay */
  SD_CS_HIGH();
  SD_IO_WriteDummy();

  return ret;
}

/**
  * @brief  Get SD information about specific SD card.
  * @param  Instance  SD Instance
  * @param  pCardInfo Pointer to a BSP_SD_CardInfo structure that contains all SD
  *         card information.
  * @retval BSP Status
  */
int32_t BSP_SD_GetCardInfo(uint32_t Instance, BSP_SD_CardInfo_t *pCardInfo)
{
  int32_t ret;

  if(Instance >= SD_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
     SD_CS_HIGH();
     SD_IO_WriteDummy();

     if (SD_GetCSDRegister(&(pCardInfo->Csd)) != BSP_ERROR_NONE)
     {
       ret = BSP_ERROR_UNKNOWN_FAILURE;
     } 
     else if (SD_GetCIDRegister(&(pCardInfo->Cid)) != BSP_ERROR_NONE) 
     {
       ret = BSP_ERROR_UNKNOWN_FAILURE;
     } 
     else if (SD_GetOCRegister(&(pCardInfo->CCS)) != BSP_ERROR_NONE)
     {
       ret = BSP_ERROR_UNKNOWN_FAILURE;
     } 
     else
     {
       ret = BSP_ERROR_NONE;
     }
     if (ret == BSP_ERROR_NONE)
     {
          /* CardCapacity in MB else it might exceed 32bits */
          /* LogBlockNbr is the max nb of blocks of LogBlockSize (512) Bytes */
          if(CardType == SD_CARD_SDHC )
         {
            pCardInfo->LogBlockSize = 512UL;
            pCardInfo->CardBlockSize = 512UL;
            pCardInfo->CardCapacity = (pCardInfo->Csd.version.v2.DeviceSize + 1U) * 1024UL * pCardInfo->LogBlockSize;
            pCardInfo->LogBlockNbr = (pCardInfo->Csd.version.v2.DeviceSize + 1U) * 1024UL;
          }
          else
          {
            pCardInfo->CardCapacity = ((uint32_t)pCardInfo->Csd.version.v1.DeviceSize + 1U) ;
            pCardInfo->CardCapacity *= (1UL << (pCardInfo->Csd.version.v1.DeviceSizeMul + 2U));
            pCardInfo->LogBlockSize = 512UL;
            pCardInfo->CardBlockSize = (1UL << (uint32_t)pCardInfo->Csd.RdBlockLen);
            pCardInfo->CardCapacity *= pCardInfo->CardBlockSize;
            pCardInfo->LogBlockNbr = (pCardInfo->CardCapacity) / (pCardInfo->LogBlockSize);
          }
     }
  }

  /* Return BSP status */
  return ret;
}

/**
  * @brief BSP SD Abort callbacks
  * @param  Instance     SD Instance
  * @retval None
  */
__weak void BSP_SD_AbortCallback(uint32_t Instance)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(Instance);
}

/**
  * @brief BSP Tx Transfer completed callbacks
  * @param  Instance     SD Instance
  * @retval None
  */
__weak void BSP_SD_WriteCpltCallback(uint32_t Instance)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(Instance);
}

/**
  * @brief BSP Rx Transfer completed callbacks
  * @param  Instance     SD Instance
  * @retval None
  */
__weak void BSP_SD_ReadCpltCallback(uint32_t Instance)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(Instance);
}

/**
  * @brief  This function handles EXTI_LINE_0 interrupt request.
  * @retval None
  */
void BSP_SD_IRQHandler(void)
{
  HAL_EXTI_IRQHandler(&hsd_exti);
}
/**
  * @}
  */

/** @defgroup STM32G474E-EVAL_SD_Private_Functions Private Functions
  * @{
  */
/*******************************************************************************
                            Static Functions
*******************************************************************************/

/**
  * @brief  Writes 1 block to a specified address in an SD card, in polling mode.
  * @param  Instance   SD Instance
  * @param  pData      Pointer to the buffer that will contain the data to transmit
  * @param  WriteAddr  address from where data is to be written
  *                    WriteAddr is a multiple of BlockSize
  * @param  BlockSize  Size of SD blocks to write that should be 512
  * @retval BSP status
  */
static int32_t SD_WriteBlock(uint32_t Instance, uint8_t* pData, uint32_t WriteAddr, uint16_t BlockSize)
{
  int32_t ret;
  SD_CmdAnswer_typedef response;

  if((Instance >= SD_INSTANCES_NBR) || ( BlockSize != SD_BLOCKSIZE))
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
     uint8_t ptr[SD_BLOCKSIZE];

     SD_CS_LOW();
     SD_IO_WriteDummy();
     SD_IO_WriteDummy();

     /* in case of SDXC/SDHC cards, the BLOCK_LEN is set to 512
         so that CMD16 is not required */
     response = SD_SendCmd(SD_CMD_SET_BLOCKLEN, BlockSize, 0xFF, (uint8_t)SD_ANSWER_R1_EXPECTED);
     SD_CS_HIGH();
     SD_IO_WriteDummy();
     if ( response.r1 != (uint8_t)SD_R1_NO_ERROR)
     {
          /* Send dummy byte: 8 Clock pulses of delay */
          SD_CS_HIGH();
          SD_IO_WriteDummy();
	      return BSP_ERROR_PERIPH_FAILURE;
     }

     /* Data transfer */
        /* Send CMD24 (SD_CMD_WRITE_SINGLE_BLOCK) to write blocks  and
           Check if the SD acknowledged the write block command: R1 response (0x00: no errors) */
        response = SD_SendCmd(SD_CMD_WRITE_SINGLE_BLOCK, (WriteAddr * ((CardType == SD_CARD_SDHC) ? 1U : SD_BLOCKSIZE) / SD_BLOCKSIZE), 0xFF, (uint8_t)SD_ANSWER_R1_EXPECTED);
        if (response.r1 != (uint8_t)SD_R1_NO_ERROR)
        {
          /* Send dummy byte: 8 Clock pulses of delay */
          SD_CS_HIGH();
          SD_IO_WriteDummy();
	      return BSP_ERROR_COMPONENT_FAILURE;
        }

