STMicroelectronics/STM32CubeG4/Drivers/BSP/STM32G474E-EVAL/stm32g474e_eval_sd.c
      /* Byte 3 */
      Csd->MaxBusClkFrec = CSD_Tab[3];

      /* Byte 4/5 */
      Csd->CardComdClasses = (uint16_t)(((uint16_t)CSD_Tab[4] << 4U) | ((uint16_t)(CSD_Tab[5] & 0xF0U) >> 4U));
      Csd->RdBlockLen = CSD_Tab[5] & 0x0FU;

      /* Byte 6 */
      Csd->PartBlockRead   = (CSD_Tab[6] & 0x80U) >> 7;
      Csd->WrBlockMisalign = (CSD_Tab[6] & 0x40U) >> 6;
      Csd->RdBlockMisalign = (CSD_Tab[6] & 0x20U) >> 5;
      Csd->DSRImpl         = (CSD_Tab[6] & 0x10U) >> 4;

      /*************************************************************************
        CSD v1/v2 decoding
      *************************************************************************/

      if(CardType == SD_CARD_SDSC)
      {
        Csd->version.v1.Reserved1 = ((CSD_Tab[6] & 0x0CU) >> 2U);

        Csd->version.v1.DeviceSize =  ((CSD_Tab[6] & 0x03U) << 10U)
                                    |  (CSD_Tab[7] << 2U)
                                    | ((CSD_Tab[8] & 0xC0U) >> 6U);
        Csd->version.v1.MaxRdCurrentVDDMin = (CSD_Tab[8] & 0x38U) >> 3U;
        Csd->version.v1.MaxRdCurrentVDDMax = (CSD_Tab[8] & 0x07U);
        Csd->version.v1.MaxWrCurrentVDDMin = (CSD_Tab[9] & 0xE0U) >> 5U;
        Csd->version.v1.MaxWrCurrentVDDMax = (CSD_Tab[9] & 0x1CU) >> 2U;
        Csd->version.v1.DeviceSizeMul = ((CSD_Tab[9] & 0x03U) << 1U)
                                       |((CSD_Tab[10] & 0x80U) >> 7U);
      }
      else 
      {
        Csd->version.v2.Reserved1 = ((CSD_Tab[6] & 0x0FU) << 2U) | ((CSD_Tab[7] & 0xC0U) >> 6U);
        Csd->version.v2.DeviceSize= ((CSD_Tab[7] & 0x3FU) << 16U) | (CSD_Tab[8] << 8U) | CSD_Tab[9];
        Csd->version.v2.Reserved2 = ((CSD_Tab[10] & 0x80U) >> 8U);
      }

      Csd->EraseSingleBlockEnable = (CSD_Tab[10] & 0x40U) >> 6U;
      Csd->EraseSectorSize   = ((CSD_Tab[10] & 0x3FU) << 1U)
                              |((CSD_Tab[11] & 0x80U) >> 7U);
      Csd->WrProtectGrSize   = (CSD_Tab[11] & 0x7FU);
      Csd->WrProtectGrEnable = (CSD_Tab[12] & 0x80U) >> 7U;
      Csd->Reserved2         = (CSD_Tab[12] & 0x60U) >> 5U;
      Csd->WrSpeedFact       = (CSD_Tab[12] & 0x1CU) >> 2U;
      Csd->MaxWrBlockLen     = ((CSD_Tab[12] & 0x03U) << 2U)
                              |((CSD_Tab[13] & 0xC0U) >> 6U);
      Csd->WriteBlockPartial = (CSD_Tab[13] & 0x20U) >> 5U;
      Csd->Reserved3         = (CSD_Tab[13] & 0x1FU);
      Csd->FileFormatGrouop  = (CSD_Tab[14] & 0x80U) >> 7U;
      Csd->CopyFlag          = (CSD_Tab[14] & 0x40U) >> 6U;
      Csd->PermWrProtect     = (CSD_Tab[14] & 0x20U) >> 5U;
      Csd->TempWrProtect     = (CSD_Tab[14] & 0x10U) >> 4U;
      Csd->FileFormat        = (CSD_Tab[14] & 0x0CU) >> 2U;
      Csd->Reserved4         = (CSD_Tab[14] & 0x03U);
      Csd->crc               = (CSD_Tab[15] & 0xFEU) >> 1U;
      Csd->Reserved5         = (CSD_Tab[15] & 0x01U);
    }
  }

  /* Send dummy byte: 8 Clock pulses of delay */
  SD_CS_HIGH();
  SD_IO_WriteDummy();

  /* Return the reponse */
  return retr;
}

/**
  * @brief  Read the CID card register.
  *         Reading the contents of the CID register in SPI mode is a simple
  *         read-block transaction.
  * @param  Cid pointer on an CID register structure
  * @retval BSP status
  */
static int32_t SD_GetCIDRegister(SD_CardIdData_t* Cid)
{
  uint8_t counter;
  int32_t retr = BSP_ERROR_PERIPH_FAILURE;
  uint8_t CID_Tab[16];

  SD_CmdAnswer_typedef response;

  /* SD chip select low */
  SD_CS_LOW();

  /* Send CMD10 (CID register) and Wait for response in the R1 format (0x00 is no error) */
  response = SD_SendCmd(SD_CMD_SEND_CID, 0, 0xFF, (uint8_t)SD_ANSWER_R1_EXPECTED);

  if(response.r1 == (uint8_t)SD_R1_NO_ERROR)
  {
    if(SD_WaitData(SD_TOKEN_START_DATA_SINGLE_BLOCK_READ) == BSP_ERROR_NONE)
    {
      /* Store CID register value on CID_Tab */
      for (counter = 0; counter < (uint8_t)16; counter++)
      {
        CID_Tab[counter] = SD_IO_ReadByte();
      }

      /* Get CRC bytes (not really needed by us, but required by SD) */
      SD_IO_WriteDummy();
      SD_IO_WriteDummy();

      /* Byte 0 */
      Cid->ManufacturerID = CID_Tab[0];

      /* Byte 1 */
      Cid->OEM_AppliID = CID_Tab[1] << 8U;

      /* Byte 2 */
      Cid->OEM_AppliID |= CID_Tab[2];

      /* Byte 3 */
      Cid->ProdName1 = CID_Tab[3] << 24U;

      /* Byte 4 */
      Cid->ProdName1 |= CID_Tab[4] << 16U;

      /* Byte 5 */
      Cid->ProdName1 |= CID_Tab[5] << 8U;

      /* Byte 6 */
      Cid->ProdName1 |= CID_Tab[6];

      /* Byte 7 */
      Cid->ProdName2 = CID_Tab[7];

      /* Byte 8 */
      Cid->ProdRev = CID_Tab[8];

      /* Byte 9 */
      Cid->ProdSN = CID_Tab[9] << 24U;

      /* Byte 10 */
      Cid->ProdSN |= CID_Tab[10] << 16U;

      /* Byte 11 */
      Cid->ProdSN |= CID_Tab[11] << 8U;

      /* Byte 12 */
      Cid->ProdSN |= CID_Tab[12];

      /* Byte 13 */
      Cid->Reserved1 |= (CID_Tab[13] & 0xF0U) >> 4U;
      Cid->ManufactDate = (CID_Tab[13] & 0x0FU) << 8U;

      /* Byte 14 */
      Cid->ManufactDate |= CID_Tab[14];

      /* Byte 15 */
      Cid->CID_CRC = (CID_Tab[15] & 0xFEU) >> 1U;
      Cid->Reserved2 = 1;

      retr = BSP_ERROR_NONE;
    }
  }

  /* Send dummy byte: 8 Clock pulses of delay */
  SD_CS_HIGH();
  SD_IO_WriteDummy();

  /* Return the reponse */
  return retr;
}

/**
  * @brief  Read the OCR card register.
  *         Reading the contents of the OCR register in SPI mode is a simple
  *         CMD58 transaction.
  * @param  pCCS pointer to the Card Capacity Status
  * @retval BSP status
  */
static int32_t SD_GetOCRegister(uint8_t* pCCS)
{
   int32_t retr = BSP_ERROR_PERIPH_FAILURE;
   SD_CmdAnswer_typedef response;

   SD_CS_LOW();
   /* Send CMD58 (SD_CMD_READ_OCR) to initialize SDHC or SDXC cards: R3 response (0x00: no errors) */
   response = SD_SendCmd(SD_CMD_READ_OCR, 0x0A, 0xFD, (uint8_t)SD_ANSWER_R3_EXPECTED);

   /* CCS is bit 30 of the OCR */

   if(response.r1 == (uint8_t)SD_R1_NO_ERROR)
   {
      /* CCS is 0 for Standard Capacity cards, 1 for High capacity cards */
      *pCCS = ((response.r2 & 0x40U) >> 6);
      retr = BSP_ERROR_NONE;
   }

  /* Send dummy byte: 8 Clock pulses of delay */
  SD_CS_HIGH();
  SD_IO_WriteDummy();

  /* Return the reponse */
  return retr;
}

/**
  * @brief  Send 5 bytes command to the SD card and get response
  * @param  Cmd: The user expected command to send to SD card.
  * @param  Arg: The command argument.
  * @param  Crc: The CRC.
  * @param  Answer: SD_ANSWER_NOT_EXPECTED or SD_ANSWER_EXPECTED
  * @retval SD status
  */
SD_CmdAnswer_typedef SD_SendCmd(uint8_t Cmd, uint32_t Arg, uint8_t Crc, uint8_t Answer)
{
  uint8_t frame[SD_CMD_LENGTH], frameout[SD_CMD_LENGTH];
  SD_CmdAnswer_typedef retr = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF};
  uint8_t counter = 0;

  /* R1 Length = NCS(0)+ 6 Bytes command + NCR(min1 max8) + 1 Bytes answer + NEC(0) = 15bytes */
  /* R1b identical to R1 + Busy information                                                   */
  /* R2 Length = NCS(0)+ 6 Bytes command + NCR(min1 max8) + 2 Bytes answer + NEC(0) = 16bytes */

  /* Prepare Frame to send */
  frame[0] = (Cmd | 0x40U);         /* Construct byte 1 */
  frame[1] = (uint8_t)(Arg >> 24U); /* Construct byte 2 */
  frame[2] = (uint8_t)(Arg >> 16U); /* Construct byte 3 */
  frame[3] = (uint8_t)(Arg >> 8U);  /* Construct byte 4 */
  frame[4] = (uint8_t)(Arg);        /* Construct byte 5 */
  frame[5] = (Crc | 0x01U);         /* Construct byte 6 */

