STMicroelectronics/STM32CubeG4/Drivers/BSP/STM32G474E-EVAL/stm32g474e_eval_sd.c
  return status;
}

/**
  * @brief  Waits a data until a value different from SD_DUMMY_BYTE
  * @retval the read value
  */
uint8_t SD_ReadData(void)
{
  uint8_t timeout = (uint8_t)SD_READ_TIMEOUT;
  uint8_t readvalue;

  /* Check if response is got or a timeout is happen */
  do {
    readvalue = SD_IO_WriteByte(SD_DUMMY_BYTE);
    timeout--;
  }while ((readvalue == (uint8_t)SD_DUMMY_BYTE) && (timeout != 0U));

  if (timeout == 0x00U ) 
  {
    readvalue = 0xFFU;
  }

  /* got Right response */
  return readvalue;
}

/**
  * @brief  Waits a data from the SD card
  * @param  Data  Expected data from the SD card
  * @retval BSP status
  */
int32_t SD_WaitData(uint8_t Data)
{
  uint16_t timeout = 0xFFFF;
  uint8_t readvalue, tmp = SD_DUMMY_BYTE;

  /* Check if response is got or a timeout is happen */
  do
  {
    if(BSP_SPI2_SendRecv(&tmp, &readvalue, 1) != BSP_ERROR_NONE)
    {
      return BSP_ERROR_PERIPH_FAILURE;
    }
    timeout--;
  }while ((readvalue != Data) && (timeout != 0U));

  if (timeout == 0U)
  {
    /* After time out */
    return BSP_ERROR_BUSY;
  }

  /* Right response got */
  return BSP_ERROR_NONE;
}

/**
  * @brief  wait for the appropriate response from card
  * @param  Answer format of response. Possible values are :
  *                 SD_ANSWER_R1_EXPECTED
  *                 SD_ANSWER_R1B_EXPECTED
  *                 SD_ANSWER_R2_EXPECTED
  *                 SD_ANSWER_R3_EXPECTED
  *                 SD_ANSWER_R7_EXPECTED
  * @param  Response  he expected Response from the SD card
  * @retval complete response structure
  */
SD_CmdAnswer_typedef SD_WaitResponse(uint8_t Answer, uint8_t Response)
{
  SD_CmdAnswer_typedef response = {0xFF, 0xFF , 0xFF, 0xFF, 0xFF};
  uint32_t timeout = 6;

  if (Answer == (uint8_t)SD_ANSWER_R1_EXPECTED)
  {
    while ((response.r1 != Response) && (timeout != 0U))
    {
      response.r1 = SD_IO_ReadByte();
      timeout--;
    }
  }
  else if (Answer == (uint8_t)SD_ANSWER_R1_EXPECTED)
  {
    /* R1 format plus the optionnal busy signal */
    while ((response.r1 != Response) && (timeout != 0U))
    {
      response.r1 = SD_IO_ReadByte();
      timeout--;
    }
    timeout = 0xFF;
    /* get the busy signal : poll until a non-zero value is returned */
    do
    {
      response.r2 = SD_IO_ReadByte();
      timeout--;
    } while ((response.r2 == (uint8_t)0) && (timeout != 0U));
  }
  else if (Answer == (uint8_t)SD_ANSWER_R2_EXPECTED)
  {
    while ((response.r1 != Response) && (timeout != 0U))
    {
      response.r1 = SD_IO_ReadByte();
      timeout--;
    }
    response.r2 = SD_IO_ReadByte();
  }
  else if ((Answer == (uint8_t)SD_ANSWER_R3_EXPECTED) || (Answer == (uint8_t)SD_ANSWER_R7_EXPECTED))
  {
    while ((response.r1 != Response) && (timeout != 0U))
    {
      response.r1 = SD_IO_ReadByte();
      timeout--;
    }
    response.r2 = SD_IO_ReadByte();
    response.r3 = SD_IO_ReadByte();
    response.r4 = SD_IO_ReadByte();
    response.r5 = SD_IO_ReadByte();
  }
  else
  {
    /* nothing to do */
  }

  return response;
}
#if defined (USE_SPI_DMA)
/**
  * @brief  Initializes the SD MSP.
  * @param  hsd SD handle
  * @retval None
  */
static void SD_Msp_Init(SD_HandleTypeDef *hsd)
{
  static DMA_HandleTypeDef dma_rx_handle;
  static DMA_HandleTypeDef dma_tx_handle;
  static DMA_HandleTypeDef dma_rx_handle2;
  static DMA_HandleTypeDef dma_tx_handle2;

    /* Enable DMA2 clocks */
    SD_DMAx_TxRx_CLK_ENABLE();

    dma_rx_handle.Init.Channel             = SD_SDMMC_DMAx_Rx_CHANNEL;
    dma_rx_handle.Init.Direction           = DMA_PERIPH_TO_MEMORY;
    dma_rx_handle.Init.PeriphInc           = DMA_PINC_DISABLE;
    dma_rx_handle.Init.MemInc              = DMA_MINC_ENABLE;
    dma_rx_handle.Init.PeriphDataAlignment = DMA_PDATAALIGN_WORD;
    dma_rx_handle.Init.MemDataAlignment    = DMA_MDATAALIGN_WORD;
    dma_rx_handle.Init.Mode                = DMA_PFCTRL;
    dma_rx_handle.Init.Priority            = DMA_PRIORITY_VERY_HIGH;
    dma_rx_handle.Init.FIFOMode            = DMA_FIFOMODE_ENABLE;
    dma_rx_handle.Init.FIFOThreshold       = DMA_FIFO_THRESHOLD_FULL;
    dma_rx_handle.Init.MemBurst            = DMA_MBURST_INC4;
    dma_rx_handle.Init.PeriphBurst         = DMA_PBURST_INC4;
    dma_rx_handle.Instance                 = SD_SDMMC_DMAx_Rx_STREAM;

    /* Associate the DMA handle */
    __HAL_LINKDMA(hsd, hdmarx, dma_rx_handle);

    /* Deinitialize the stream for new transfer */
    (void)HAL_DMA_DeInit(&dma_rx_handle);

    /* Configure the DMA stream */
    (void)HAL_DMA_Init(&dma_rx_handle);

    dma_tx_handle.Init.Channel             = SD_SDMMC_DMAx_Tx_CHANNEL;
    dma_tx_handle.Init.Direction           = DMA_MEMORY_TO_PERIPH;
    dma_tx_handle.Init.PeriphInc           = DMA_PINC_DISABLE;
    dma_tx_handle.Init.MemInc              = DMA_MINC_ENABLE;
    dma_tx_handle.Init.PeriphDataAlignment = DMA_PDATAALIGN_WORD;
    dma_tx_handle.Init.MemDataAlignment    = DMA_MDATAALIGN_WORD;
    dma_tx_handle.Init.Mode                = DMA_PFCTRL;
    dma_tx_handle.Init.Priority            = DMA_PRIORITY_VERY_HIGH;
    dma_tx_handle.Init.FIFOMode            = DMA_FIFOMODE_ENABLE;
    dma_tx_handle.Init.FIFOThreshold       = DMA_FIFO_THRESHOLD_FULL;
    dma_tx_handle.Init.MemBurst            = DMA_MBURST_INC4;
    dma_tx_handle.Init.PeriphBurst         = DMA_PBURST_INC4;
    dma_tx_handle.Instance                 = SD_SDMMC_DMAx_Tx_STREAM;

    /* Associate the DMA handle */
    __HAL_LINKDMA(hsd, hdmatx, dma_tx_handle);

    /* Deinitialize the stream for new transfer */
    (void)HAL_DMA_DeInit(&dma_tx_handle);

    /* Configure the DMA stream */
    (void)HAL_DMA_Init(&dma_tx_handle);

    /* NVIC configuration for DMA transfer complete interrupt */
    HAL_NVIC_SetPriority(SD_SDMMC_DMAx_Rx_IRQn, BSP_SD_RX_IT_PRIORITY, 0);
    HAL_NVIC_EnableIRQ(SD_SDMMC_DMAx_Rx_IRQn);

    /* NVIC configuration for DMA transfer complete interrupt */
    HAL_NVIC_SetPriority(SD_SDMMC_DMAx_Tx_IRQn, BSP_SD_TX_IT_PRIORITY, 0);
    HAL_NVIC_EnableIRQ(SD_SDMMC_DMAx_Tx_IRQn);

